Repository: AlynxZhou/showmethekey
Catalog: showmethekey-gtk/po/*.po
Languages: es_es

source: Show Me The Key
es_es: Muéstrame La Tecla

source: Display version then exit.
es_es: Mostrar versión y salir.

source: translator-credits
es_es: ItzSelenux

source: About Show Me The Key
es_es: Acerca de Muéstrame la Tecla

source: Show keys you typed on screen.
es_es: Muestra las teclas que escribiste en pantalla.

source: Menu
es_es: Menú

source: Primary menu
es_es: Menú principal

source: _Clickable
es_es: _Clickeable

source: _Pause
es_es: _Pausa

source: Show _Shift Separately
es_es: Mostrar _Shift Separadamente

source: Show Ctrl+Shift+a or Ctrl+A.
es_es: Mostrar Ctrl+Shift+a o Ctrl+A.

source: Show _Mouse Button
es_es: Mostrar _Botón del Ratón

source: Mouse buttons can be very annoying.
es_es: Los botones del ratón pueden ser muy molestos.

source: Draw Keys _Border
es_es: Dibujar _Borde de Teclas

source: In case keys and key combos are hard to distinguish.
es_es: En caso de que las teclas y combinaciones de teclas sean difíciles de distinguir.

source: Display Mode
es_es: Modo de Pantalla

source: Raw is Linux kernel's scancode and maybe not so useful.
es_es: "Bruto" es el código de escaneo del núcleo de Linux y tal vez no sea tan útil.

source: Composed
es_es: Compuesto

source: Raw
es_es: Bruto

source: Compact
es_es: Compacto

source: Timeout (ms)
es_es: Tiempo de Espera (ms)

source: Clear keys if no new key after how many miliscconds. Set to 0 to keep all keys.
es_es: Borrar teclas si no hay nuevas teclas después de cuántos milisegundos. Establecer en 0 para mantener todas las teclas.

source: Width (px)
es_es: Anchura (px)

source: Width of keys window.
es_es: Anchura de la ventana de teclas.

source: Height (px)
es_es: Altura (px)

source: Height of keys window.
es_es: Altura de la ventana de teclas.

source: Keyboard
es_es: Teclado

source: Keymap
es_es: Distribución de Teclas

source: Choose your keyboard layout and variant.
es_es: Elija su distribución y variante del teclado.

source: _Usage
es_es: _Uso

source: _About Show Me The Key
es_es: _Acerca de Muéstrame La Tecla

source: _Quit
es_es: _Salir

source: Usage
es_es: Uso

source: 1. Please input admin password after toggling the switch, because it needs superuser permission to read input events, and Wayland does not allow running graphics program with superuser permission, so it uses polkit to run a backend with superuser permission. This program does not handle or store your password. Users in `wheel` group can skip password authentication. 2. After you toggle the switch to show the floating window, you need to drag it manually to anywhere you want, because Wayland does not allow window to set its position. The "Clickable" label on titlebar can be dragged as a handle. 3. Because Wayland does not allow a window to set "Always on Top" and "Always on Visible Workspace" by itself, you should set it manually if you are in a Wayland session and your window manager support it. For example if you are using GNOME Shell (Wayland), you can right click the "Clickable" on title bar to show a window manager menu and check "Always on Top" and "Always on Visible Workspace" in it. If you are using KDE Plasma (Wayland), you can right click "Floating Window - Show Me The Key" on task bar, check "Move to Desktop" -> "All Desktops" and "More Actions" -> "Keep Above Other". You can check this project's <a href="https://github.com/AlynxZhou/showmethekey#special- notice-for-wayland-session-users">README</a> to see if there are configurations for your compositor. 4. To allow user move or resize the keys window, it is not click through by default, after moving it to the location you want, turn off "Clickable" switch so it won't block your other operations. 5. If you want to pause it (for example you need to insert password), you can use the "Pause" switch, it will not record your keys when paused. 6. Set Timeout to 0 if you want to keep all keys. You can open this dialog again via menu icon on title bar -> "Usage".
es_es: 1. Por favor, ingrese la contraseña de administrador después de activar el interruptor. Los permisos elevados son necesarios para leer eventos de entrada, y Wayland no permite ejecutar programas gráficos con permisos elevados, por lo que se utiliza polkit para ejecutar un backend con permisos elevados. Este programa no maneja ni almacena su contraseña. Los usuarios en el grupo `wheel` pueden omitir la autenticación de contraseña. 2. Después de activar el interruptor para mostrar la ventana flotante, debe arrastrarla manualmente a cualquier lugar que desee, porque Wayland no permite que la ventana establezca su posición. La etiqueta "Clickable" en la barra de título se puede arrastrar con el cursor. 3. Debido a que Wayland no permite que una ventana establezca "Siempre Encima" y "Siempre en el Espacio de Trabajo Visible" por sí misma, debe configurarlo manualmente si está en una sesión de Wayland y su gestor de ventanas lo admite. Por ejemplo, si está utilizando GNOME Shell (Wayland), puede hacer clic derecho en "Clickable" en la barra de título para mostrar un menú del gestor de ventanas y marcar "Siempre encima" y "Siempre en el Espacio de Trabajo Visible" en él. Si está utilizando KDE Plasma (Wayland), puede hacer clic derecho en "Floating Window - Show Me The Key" en la barra de tareas, marcar "Mover al Escritorio" -> "Todos los Escritorios" y "Más Acciones" -> "Mantener Encima". Puede consultar <a href="https://github.com/AlynxZhou/showmethekey#special-notice-for-wayland-session-users">README</a> para ver si hay configuraciones para su compositor. 4. Para permitir al usuario mover o cambiar el tamaño de la ventana de teclas, no es clickeable por defecto, después de moverlo a la ubicación deseada, apague el interruptor "Clickeable" para que no bloquee sus otras operaciones. 5. Si desea pausarlo (por ejemplo, necesita ingresar una contraseña), puede utilizar el interruptor "Pausa", no registrará sus teclas cuando esté en pausa. 6. Establezca el tiempo de espera en 0 si desea mantener todas las teclas. Puede abrir este diálogo nuevamente a través del icono de menú en la barra de título -> "Uso".

source: Clickable
es_es: Clickeable
